In [1]:
import pandas as pd
india_weather={
    'city':['mumbai','dehi','banglor'],
    'temperature':[32,45,30],
    'humidity':[90,80,78]
}
df1=pd.DataFrame(india_weather)
df1

      city  temperature  humidity
0   mumbai           32        90
1     dehi           45        80
2  banglor           30        78

In [2]:
usa_weather={
    'city':['new yark','chicago','oriando'],
    'temperature':[23,24,32],
    'humidity':[60,70,88]
}
df2=pd.DataFrame(usa_weather)
df2

       city  temperature  humidity
0  new yark           23        60
1   chicago           24        70
2   oriando           32        88

In [3]:
df=pd.concat([df1,df2],ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        90
1      dehi           45        80
2   banglor           30        78
3  new yark           23        60
4   chicago           24        70
5   oriando           32        88

In [4]:
df3=pd.concat([df1,df2],keys=['india','usa'])
df3

             city  temperature  humidity
india 0    mumbai           32        90
      1      dehi           45        80
      2   banglor           30        78
usa   0  new yark           23        60
      1   chicago           24        70
      2   oriando           32        88

In [5]:
df3.loc['india']

      city  temperature  humidity
0   mumbai           32        90
1     dehi           45        80
2  banglor           30        78

In [6]:
df3.loc['usa']

       city  temperature  humidity
0  new yark           23        60
1   chicago           24        70
2   oriando           32        88

In [20]:
temperature_df=pd.DataFrame({
    'city':['mumbai','banglore','delhi'],
    'temperature':[22,45,30]
},index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           22
1  banglore           45
2     delhi           30

In [25]:
windspeed_df=pd.DataFrame({
    'city':['delhi','banglore','mumbai'],
    'windspeed':[5,8,6]
},index=[2,1,0])
windspeed_df

       city  windspeed
2     delhi          5
1  banglore          8
0    mumbai          6

In [26]:
df=pd.concat([temperature_df,windspeed_df],axis=1)
df

       city  temperature      city  windspeed
0    mumbai           22    mumbai          6
1  banglore           45  banglore          8
2     delhi           30     delhi          5

In [28]:
temperature_df

       city  temperature
0    mumbai           22
1  banglore           45
2     delhi           30

In [29]:
s=pd.Series(['Humid','dry','Rain'],name='event')
s

0    Humid
1      dry
2     Rain
Name: event, dtype: object

In [32]:
df=pd.concat([temperature_df,s],axis=1)
df

       city  temperature  event
0    mumbai           22  Humid
1  banglore           45    dry
2     delhi           30   Rain